import re

OFFICE_WORDS = {"отдел", "управление", "департамент", "институт", "центр", "министерство",
    "палата",  "управа", "фбу", "фау", "фонд",  "комиссия",  "служба",
    "агентство", "отделение",  "инспекция",  "аппарат", "комитет",
    "правительство",  "администрация",
    "совет",  "дума",  "собрание", "хурал",
    "ано", "ик",  "гоу",  "гбоу",  "фгаоу", "фгбу", "гу",
    "школа",
    "больница", "клиника", "поликлиника",
    "прокуратура", "суд",
    "глава",  "губернатор", "президент", "мэр",
    "учреждение",
    "колония",
    "представительство", # постоянное представительство
    "префектура"
}


def has_office_word_in_beginning(text, max_index=3):
    words = re.split('[\s,"]', text.lower())
    for w in words[:max_index]:
        if w is not None and w in OFFICE_WORDS:
            return True
    return False
